export type UnitLevel = {
  id: number;
  name: string; // Назва рівня підрозділу (наприклад, "взвод", "рота", "батальйон" тощо)
  description: string; // Опис рівня підрозділу
  level: number; // Числовий рівень підрозділу (наприклад, 1 для найнижчого рівня, 2 для наступного тощо)
};

export const UNIT_LEVELS: UnitLevel[] = [
  {
    id: 1,
    name: "вогнева або маневрова команда / група",
    description: "Підрозділ.", // Дані про чисельність та складові відсутні у наданій таблиці
    level: 1,
  },
  {
    id: 2,
    name: "відділення, обслуга, екіпаж, рій",
    description:
      "Підрозділ. Чисельність: 8 – 12. Складові: 2+ солдатів або 2-3 вогневі групи.",
    level: 2,
  },
  {
    id: 3,
    name: "секція, патруль",
    description: "Підрозділ. Чисельність: 8 – 24. Складові: 2+ солдатів.",
    level: 3,
  },
  {
    id: 4,
    name: "взвод, чота",
    description:
      "Підрозділ. Чисельність: 26 – 55. Складові: 2+ відділень, секцій або машин.",
    level: 4,
  },
  {
    id: 5,
    name: "штафель",
    description: "Підрозділ. Чисельність: 40 – 160. Складові: 2+ взводів.",
    level: 5,
  },
  {
    id: 6,
    name: "рота, батарея",
    description:
      "Частина. Чисельність: 80 – 250. Складові: 2+ штафелів, 2-8 взводів.",
    level: 6,
  },
  {
    id: 7,
    name: "батальйон, дивізіон, ескадрон",
    description:
      "Частина. Чисельність: 300 – 1 000. Складові: 2–6 роти, батареї.",
    level: 7,
  },
  {
    id: 8,
    name: "полк",
    description:
      "Частина. Чисельність: 1 000 – 3 000. Складові: 2+ батальйони.",
    level: 8,
  },
  {
    id: 9,
    name: "бригада, бригадна бойова група",
    description:
      "З'єднання. Чисельність: 3 000 – 5 000. Складові: 2+ полки, 3–6 батальйонів.",
    level: 9,
  },
  {
    id: 10,
    name: "дивізія",
    description:
      "З'єднання. Чисельність: 6 000 – 25 000. Складові: 2-4 бригади або полки.",
    level: 10,
  },
  {
    id: 11,
    name: "корпус, оперативна група",
    description:
      "З'єднання / оперативно-тактичне об'єднання. Чисельність: 20 000 – 50 000. Складові: 2+ дивізії.",
    level: 11,
  },
  {
    id: 12,
    name: "армія, армійська група",
    description:
      "Оперативне об'єднання. Чисельність: 100 000 – 200 000. Складові: 2-4 корпуси.",
    level: 12,
  },
  {
    id: 13,
    name: "група армій, армійська група, фронт",
    description:
      "Оперативно-стратегічне об'єднання. Чисельність: 400 000 – 1 000 000. Складові: 2+ армії.",
    level: 13,
  },
  {
    id: 14,
    name: "театр війни, театр воєнних дій",
    description:
      "Оперативно-стратегічне об'єднання. Чисельність: 1 000 000 – 10 000 000. Складові: 4+ груп армій.",
    level: 14,
  },
];
